from aiogram import types
from aiogram.utils.markdown import link
from aiogram.utils.emoji import emojize


def quest_data():
    return [
        {
            "task_num": 0,
            "question": "Завдання 1:\nНайпопулярніший вид комічного?",
            "answers": [
                {
                    "text": "Меми",
                    "callback_data": "correct_answer|0",
                    "correct": True
                },
                {
                    "text": "Сатира",
                    "callback_data": "wrong_answer|Неправильно! Спробуй ще раз!",
                    "correct": False
                },
                {
                    "text": "Гумор",
                    "callback_data": "wrong_answer|Неправильно! Спробуй ще раз!",
                    "correct": False
                },
                {
                    "text": "Смішні історії Брюха",
                    "callback_data": "wrong_answer|Неправильно! Спробуй ще раз!",
                    "correct": False
                }
            ],
            "task": f"{link('Локація мемів', 'https://t.me/naukmeme')} підготувала для тебе багато Могилянського та смішного. "
                    "Обов'язково переглянь, який ти мем за гороскопом!\n"
                    "А ми заховали там секретне питання!\n"
                    "Як знайдеш питання, то повертайся сюди та пиши свою відповідь внизу.",
            "ans": ["букиця"]
        },
        {
            "task_num": 1,
            "question": "Завдання 2:\nти маєш дещо в собі\n"
                        "і вона\n"
                        "і він\n\n"

                        "ви особливі. тому ви точно там зустрінетеся. проявите себе."
                        " побачите один одного. почуєте. відчуєте. це почнеться. і це має продовжуватися..\n\n"

                        "що це?",
            "answers": [
                {
                    "text": "Приймальна комісія НаУКМА",
                    "callback_data": "wrong_answer|Неправильно! Спробуй ще раз!",
                    "correct": False
                },
                {
                    "text": "Домашній виступ",
                    "callback_data": "wrong_answer|Неправильно! Спробуй ще раз!",
                    "correct": False
                },
                {
                    "text": "Шоу талантів",
                    "callback_data": "correct_answer|1",
                    "correct": True
                },
                {
                    "text": "Творчий вечір",
                    "callback_data": "wrong_answer|Неправильно! Спробуй ще раз!",
                    "correct": False
                }
            ],
            "task": "Могилянці мають купу талантів."
                    f" Маленьку частинку з них ти знайдеш на сторінці {link('Карантиннику талантів', 'https://www.instagram.com/karantinnik/')}.\n"
                    "Серед усіх цих талантів сховане питання, яке відкриє тобі шлях до наступної локації. "
                    "Чекаємо тебе тут із правильною відповіддю! ",
            "ans": ["500", "500 гривень", "п'ятсот", "п'ятсот гривень", "500 грн", "500грн"]
        },
        {
            "task_num": 2,
            "question": "Завдання 3:\nЯк передати привіт людині, яка одночасно дуже поруч і дуже далеко?"
                        " Що потрібно, щоб зустрітись та нічого не забути? Машина часу? Хіба?",
            "answers": [
                {
                    "text": "Лист у майбутнє",
                    "callback_data": "correct_answer|2",
                    "correct": True
                },
                {
                    "text": "Фотографія",
                    "callback_data": "wrong_answer|Неправильно! Спробуй ще раз!",
                    "correct": False
                },
                {
                    "text": "Квиток на потяг",
                    "callback_data": "wrong_answer|Неправильно! Спробуй ще раз!",
                    "correct": False
                },
                {
                    "text": "СМС-ка",
                    "callback_data": "wrong_answer|Неправильно! Спробуй ще раз!",
                    "correct": False
                }
            ],
            "task": f"Так-так, {link('листи у майбутнє', 'https://docs.google.com/forms/d/e/1FAIpQLSeQd96BhhTFB-nedvErdfQr9Mlz20BZVHPXGYIxb8Mgwll6eA/viewform?usp=sf_link')}!\n"
                    "І ти зможеш написати собі такий. А через 4 роки отримати звісточку з минулого.\n"
                    "Традиційно — шукай питання, повертайся з відповіддю!\n"
                    "Підказка: Щоб знайти секретне питання, уважно подивись 'в кінці' локації!",
            "ans": ["28 червня", "двадцять восьме червня", "Двадцять восьме червня", "28-ме червня", "28.06"]
        },
        {
            "task_num": 3,
            "question": "Завдання 4:\nУ викрикуванні яких назв змагаються студенти під час могилянських заходів?",
            "answers": [
                {
                    "text": "Спеціальностей",
                    "callback_data": "wrong_answer|Неправильно! Спробуй ще раз!",
                    "correct": False
                },
                {
                    "text": "Факультетів",
                    "callback_data": "correct_answer|3",
                    "correct": True
                },
                {
                    "text": "Планет Сонячної системи",
                    "callback_data": "wrong_answer|Неправильно! Спробуй ще раз!",
                    "correct": False
                },
                {
                    "text": "Кавових напоїв, які рятують під час сесії",
                    "callback_data": "wrong_answer|Неправильно! Спробуй ще раз!",
                    "correct": False
                }
            ],
            "task": f"Розкажи нам про себе, а ми розкажемо тобі, який твій істинний факультет! {link('Клацай сюди', 'http://www.quiz-maker.com/QYS5XZ3UN')}\n"
                    "Як закінчиш — чекаю тебе тут. ",
            "ans": ["шість", "Шість", "6"]
        }
    ]


def start_msg():
    return {
        "text": "Могилянка на дистанційці. Фільм жахів, анекдот чи новий сюжет чогось надзвичайного?\n"
                "Спудею, вітаємо тебе у The FreshFest — найлімітованішому доповненні всесвітньовідомої гри!\n"
                "Влаштовуйся зручніше, адже на тебе чекають кілька неймовірних годин знайомства з Могилянкою."
                " Лови університетську атмосферу на різних локаціях та шукай те, що тобі до вподоби."
                " Словом, живи насиченим університетським життям як справжній сім та твори цифрову Могилянку з нами!\n"
                "https://youtu.be/wOMBo6RYtWI"
    }


def start_quest_msg():
    return {
        "text": 'Хей хей хей!\n'
                'Де це ти? У Сансет Веллі? У Ріверсайді? Ні, ти на початку своєї подорожі у світ Могилянки!\n'
                'В цьому квесті тобі доведеться боротися за виживання, шукати скарби та перемагати драконів!'
                ' Іншими словами: будуть неймовірні локації, де ти не лише познайомишся з Могилянкою та могилянцями,'
                ' а ще й отримаєш можливість поповнити свій CAS крутецьким шопером від'
                f' {link("KMA gift shop", "https://instagram.com/kmagiftshop?igshid=g1egl66w3fkw")}.\n'
                'Я — твій помічник в цій пригоді. То що, почнемо?'}


def quest_rules():
    return {
        "text": 'Правила дуже прості:\n'
                ' 1. Відгадуй загадки, проходь локації та шукай заховані там питання. Вони відкриють'
                ' шлях до наступного завдання!\n'
                '2. Застряг/ла у квесті? Щось не зрозуміло? Пиши @urbi_ca або @AnnTomliak.\n'
                '3. Ти можеш користуватися чит-кодами, питатися у Google або своїх Бадді.\n'
                'Чи ти готова/ий починати?'}


def crslt_info():
    return {
        "text": "Півроку нас розділяють маски, екрани та кілометри. Ми сумуємо за ранковими розмовами у кав'ярні"
                " та міцними обіймами знайомих незнайомців.\n\n"
                "Локація крос-летерінгу (обміну листами) — це можливість 'відчути' "
                "людину інакше. Жодного діджиталу та примусу — лише паперові листи, добра воля та життєві історії.",
        "photo": types.InputFile('./static/crosslettering.jpg')}


def crslt_description():
    return {
        "text": "Наступним повідомленням відправ всю інфу, за якою можна тебе знайти або надіслати тобі листа: П.І.Б.,"
                " адресу, телефон, поштове відділення, інстаграм. І чекай на магію!\n\n"
                "P.S. Твоя особиста інформація буде знаходитися лише в цьому боті та не потрапить за його межі."
                " Обмін відбуватиметься виключно серед студентів Могилянки."}


def crslt_accepted():
    return {"text": "\nЯкщо ти хочеш їх змінити, просто викликай команду /crosslettering ще раз\n"
                    "Скоро ти отримаєш контакт людини, якій писатимеш листа!"}


def wrong_answer_msg():
    return {"text": "Неправильно! Спробуй ще раз!"}


def second_tips():
    return [
        {"text": "Спитайся у своїх Бадді, може вони допоможуть?"},
        {"text": "Шукай питання у перших постах 'Карантиннику талантів'..."},
        {"text": "Спитай у своїх Бадді, може вони допоможуть?"},
        {"text": "Спитай у своїх Бадді, може вони допоможуть?"}
    ]


def congratulations_msgs():
    return [
        {"text": "Молодець! Лови наступну загадку!"},
        {"text": "Ти неперевершена/ий!"},
        {"text": "Далі складніше! Лови наступну загадку!"},
        {"text": "Ти вже майже на фініші! Залишився останній крок."}
    ]


def finish_gratz():
    return {"text": f"Пам-парам-пам, вітаємо з фінішем!{emojize(':confetti_ball:')}\n"
                    "Сподіваюся, ти отримав максимум задоволення від цього квесту та зміг"
                    " з легкістю знайти усі відповіді. Тепер ти більше знаєш про могилянську спільноту та про себе."
                    " А також маєш можливість виграти в розіграші подарунків від KMA gift shop!\n"
                    "Проте це ще не все!\n"
                    "Ти можеш ще раз повернутися на будь-яку з локацій, а також – побувати на деяких нових."
                    " Тому зверни особливу увагу на “Ігри у Діскорді” та “Фреш-крослетерінг” –"
                    " там тебе точно чекає щось цікаве!"}


def help_msg():
    return {"text": "Виникли питання щодо бота? Пиши @dima_zhornyk\n"
                    "Застряг/ла у квесті? Щось не зрозуміло? Пиши @urbi_ca або @AnnTomliak\n"
                    "Будь-які інші питання: @marinmor"}


def already_completed_msg():
    return {"text": "Ти вже завершив квест, тому не можеш проходити його знову(\n"
                    "Але тобі завжди доступні всі локації за командою /info"}


def info_msg():
    return {"text": "Ось список доступних локацій:\n"
                    "/crosslettering — тисни, якщо хочеш зробити когось щасливим та отримати досвід обміну "
                    "паперовими листами;\n\n"
                    "/games — локація, де розкажуть who is Discord та прокачають твої знання в іграх;\n\n"
                    "/letter_in_future — машина часу, що підкине до конвокації , ну або локація, де "
                    "можна написати собі 'лист у майбутнє';\n\n"
                    "/karantinnik — справжнє зібрання могилянських талантів;\n\n"
                    "/memes — тобі сюди, якщо ти мамин жартівник та хочеш 'шарити' Могилянку в мемах;\n\n"
                    "/tests — не про принцес чи вищу математику, але справжні тести з могилянською тематикою;"}


def games_msg():
    return {"text": "Ти любиш грати в ігри або завжди хотів спробувати? Або, можливо, "
                    "ти хочеш весело провести час цього вечора? Тоді пропонуємо тобі наш сервер з"
                    " іграми в дискорді! Тобі про все розкажуть і ти все зрозумієш, головне –"
                    " влитися в гру та насолоджуватись!",
            "photo": types.InputFile('./static/discord.jpg')}


def discord_link_msg():
    return {"text": f"{link('Ось', '')} твій лінк, на тебе уже чекають!"}


def letter_in_future_msg():
    return {
        "text": "Чи пам‘ятаєш ти якими були твої мрії у дванадцять? Або про що ти думав у п‘ятнадцять?"
                " А чи запам’ятаєш ти, що відбувається у твоїй голові зараз?"
                "Ми гарантуємо, що так! Напиши листа самому собі у майбутнє,"
                " де можеш написати все, що завгодно: свої думки, почуття, мрії,"
                " або навіть запитання до самого себе. 20го, на спешл фреш фесті,"
                f" заповнюй формочку {link('тут', 'https://docs.google.com/forms/d/e/1FAIpQLSeQd96BhhTFB-nedvErdfQr9Mlz20BZVHPXGYIxb8Mgwll6eA/viewform?usp=sf_link')}, а ми потурбуємося про те,"
                " щоб через чотири роки звісточка з минулого успішно дісталася до тебе",
        "photo": types.InputFile('./static/mails_in_future.jpg')}


def tests_msg():
    return {
        "text": "Іспити, модульні контрольні, 'яка ти принцеса' - життя готує для нас багато тестів. "
                "Ми дбаємо про твою готовність до них, та маємо дещо, що ти ще точно не проходив."
                "Обирай з чого хочеш почати та have fun!"
                "🎲 Мама хотіла програміста, тато — правника, а ти вступив на ФСНСТ? Тест "
                f"{link('Який ти факультет', 'http://www.quiz-maker.com/QYS5XZ3UN')}? Дослідить твої звички "
                "та вподобання, щоб розставити крапки над"
                " 'і' та визначити чи правильним був твій вибір при вступі."
                "🎲 З видом на Контрактову площу чи Дніпро, ближче до Еспресохоліку чи 119, із"
                " субмариною в підвалі чи лабораторіями в авдиторіях? Не вдаватися в подробиці,"
                f" а просто пройди тест {link('Який ти корпус Могилянки', 'https://www.quiz-maker.com/QJSYD6NF9')}?",
        "photo": types.InputFile('./static/tests.jpg')
    }


def quarantynnyk_msg():
    return {
        "text": "Час упевнитись, що навіть локдаун/ізоляція/карантнин не змусять нас перестати творити. Не віриш?.."
                f"Тоді не переходь {link('сюди', 'https://www.instagram.com/karantinnik/')} , бо саме "
                "тут невгамовні могилянські таланти покажуть, на що здатні! "
                "Кажуть, буде щось дуже цікаве. Але краще перевір.",
        "photo": types.InputFile("./static/karantinnik.jpg")
    }


def memes_msg():
    return {
        "text": "Хочеш спробувати себе у створенні мемів, дізнатися щось про могилянське життя через жарти "
                f"або почитати мем-гороскоп на наступний тиждень? Залітай до нас на {link('локацію', 'https://t.me/naukmeme')}!"
                "Обіцяємо, нудно не буде🔥",
        "photo": types.InputFile('./static/memes.jpg')
    }


def forbid_msg():
    return {
        "text": "Привіт!\n"
                "Ми ще поки готуємо взлом пентагону, виносимо геймерські столи і запускаємо ігри.\n"
                "Повертайся сюди 20.09.2020 о 17:00!",
        "photo": types.InputFile('./static/ff_image.jpg')
    }


def giveaway_spam_msg():
    return {
        "text": "Уже зараз наша Чаша фортуни скаже, хто ж переміг у розіграші та отримає той самий"
                " могилянський мерч від @kmagiftshop. "
                "Долучайся до трансляції, можливо щасливчиком станеш саме ти!\n",
        "photo": types.InputFile("./static/giveaway.jpg")
    }


def karantinnik_spam_msg():
    return {
        "text": "Час розпочати наш творчий вечір, тому запрошуємо тебе на Karantynnyk!"
                f" Могилянські таланти вже зачекалися на тебе за посиланням\n",
        "photo": types.InputFile("./static/karantinnik.jpg")
    }


def ff_end_msg():
    return {
        "text": "Oops...The FreshFest завершився, твій free trial теж. До зустрічі наступного року!",
        "photo": types.InputFile("./static/finish.jpg")
    }


def so_msg():
    return {
        "text": "А якщо ви досі не знаєте, що таке СК, мрієте стати частиною театральної чи танцювальної родини,"
                " знайти себе у дебатах чи поговорити з людьми про останній сезон Наруто - вам обов'язково "
                "(чує баба? О-б-о-в'я-з-к-о-во!) потрібно заглянути в наш інстаграм. Прямо у сторіз для вас цілий"
                " день кожна Студентська Організація розповідатиме про себе.\n\n"
                "А що як твоя наступна могилянська сім'я "
                f" {link('в одному кліку?', 'https://instagram.com/buddynaukma?igshid=t4wx9oi9vmve')}"
    }


def games_descriptions():
    return [
        {"text": "•  Ти завжди був найсмішнішою людиною в класі? Твої жарти змушували людей несамовито"
                 " битися в істериці? Знаєш на пам'ять всі анекдоти з дідових газет? Тоді ця гра саме для тебе!\n"
                 "•  Що потрібно робити? Все просто! Твоє завдання – придумати смішне закінчення для фрази, таке"
                 " щоб прямо"
                 " “атвєт убіл”.Після цього учасники можуть підтримати твій жарт, проголосувавши за нього. "
                 "Найсмішніший з варіантів - перемагає.Кількість гравців – 8, раундів – 3. Тому навіть якщо ти боїшся,"
                 " спробувати завжди можна(звісно, якщо ти не помреш від концентрації крінжа).\n"
                 "•  Як грати? Адміністратор буде хостити гру та транслювати екран у дискорді."
                 "Твоє завдання – зайти на сайт jackbox.tv з телефону або іншого вікна браузера(скріншот 1), "
                 "ввести номер кімнати(скріншот 2), вписати нікнейм, ознайомитися з умовами завдань та придумати "
                 "найсмішніші відповіді! Все просто та весело.Чекаємо на твої найсмішніші жарти.",
         "photos": [types.InputFile('./static/j1.jpg'), types.InputFile('./static/j2.jpg')]
         },
        {
            "text": "Для гри в крокодила потрібно мати:\n"
                    "• відеокамеру 📽\n"
                    "• 6 та більше людей 🧑👧\n"
                    "• класний настрій! 😇\n"
                    "Усі гравці діляться на дві команди, після чого кидають жереб.\n\n"
                    "Та команда, яка програла, має вимкнути звук у діскорді(як це зробити - читай нижче). "
                    "У той самий час, їхні опоненти загадують слово(не дію!) та обирають одного гравця з команди"
                    " суперника, якому передають його.\n\n"
                    "Обрана людина матиме пояснити своїй команді, що загадали суперники, не промовляючи ні слова"
                    " (використовувати жести та рухати губами також забороняється).\n\n"
                    "Гравець може кривлятися, махати руками-ногами, та робити інші рухи, які допоможуть його команді"
                    " дізнатися правильну відповідь!\n\n"
                    "У свою чергу, гравці з його команди мають вголос казати варіанти, які спадають їм на думку, або"
                    " писати їх у чаті 🤩\n\n"
                    "На момент гри, команда, що загадала слово, і гравець, що пояснює слово, мають вимкнути свої"
                    " мікрофони в діскорді 🎤\n\n"
                    "Після правильної відповіді або дуже довгих і нереальних розгадувань, усі гравці, за бажанням, "
                    "вмикають мікрофони. Після обговорення право ходити отримує інша команда!\n\n"
                    "Вдалої гри :)\n"
                    "Звук у діскорді можна вимкнути, якщо натиснути на значок навушників біля твого профілю знизу"
                    " ліворуч. (скрін 1)\n"
                    "Слово передається через особисті повідомлення в діскорді: слід натиснути на профіль гравця у "
                    "каналі та написати йому повідомлення, після чого гравець зможе знайти своє слово в меню,"
                    " що з’явиться зліва.\n"
                    "Мікрофон вимикається так само, як і звук, проте натиснути потрібно на значок мікрофона.(скрін 1)\n"
                    "Жереб можна легко реалізувати через Generator-online.com/coin/\n",
            "photos": [types.InputFile('./static/k1.jpg')]
        },
        {
            "text": "• Що таке Keep Talking and Nobody Explodes?\n"
                    "Уявімо, що ти прокинувся у незнайомій кімнаті. Кімната ця не справляє найкращого враження,"
                    " оскільки в ній знаходяться лише стіл, годинник і, увага, БОМБА. Що нас вчили робити в такій "
                    "ситуації? Правильно, панікувати, кричати і молитися. Упс, випадково уривок з гайду щодо поведінки"
                    " під час сесії відкрився. Давай спочатку Міша, все даремно.\n"
                    "Нас вчили дихати рівно і шукати вихід з ситуації. Але я ж ніби не Альберт Ейншейн, щоб знати як"
                    " розміновувати бомбу? Так, звісно, але я впустив одну маленьку деталь. В кімнаті є рація. "
                    "А людина, що знаходиться по інший бік цієї рації, має дещо, що ми ніколи не читаємо. Інструкцію."
                    " І ця інструкція є єдиним шансом на порятунок.\n"
                    "• Правила (я знаю що ви панки, і правила для вас не важливі, але краще почитайте)\n"
                    "- Одна людина бачить бомбу і має можливість розглядати її з усіх боків. Вона бачить усе: від"
                    " кольорів дротів до серійного номеру. Деталі грають роль, оскільки:\n"
                    "- Інша людина (або люди) мають доступ до інструкції, яка дає повне розуміння того, що робити в"
                    " усіх ймовірних сценаріях. Саме за даними вказівками, людина з бомбою має виконувати певні дії."
                    " І якщо людина (або ж люди) неправильно зрозуміють того нещасливця, який тримає в руках вибухівку,"
                    " то це може призвести до вибуху. А ви ж цього не хочете? Правда? Правда.......?\n"
                    "- Час обмежений. Тому варто бути дуже пильним і за можливості зайвий раз не перепитувати 'А екран"
                    " каже ASS чи SAS?'\n"
                    "- Кожна бомба дає право на різну кількість помилок. Тобто, якщо ви перерізали не той дріт, то"
                    " якась бомба вибухне одразу, а якась просто зарахує це як помилку. І пам'ятайте, що кожна помилка"
                    " прискорює відлік часу. Тому «метод чарівного тику» варто виключити зі свого арсеналу.\n"
                    "• Як (how) в це грати?\n"
                    "Дуже просто: лише одна людина має мати доступ до гри, а усі інші можуть просто відкрити "
                    "інструкцію. Купувати гру зовсім необов'язково, оскільки вона є у наших модераторів.\n"
                    "• Де знайти інструкцію?\n"
                    "Ось тут можна знайти українську версію цієї інструкції.\n"
                    "• А якщо я хочу грати саме в ролі сапера?\n"
                    "Для цього доведеться купувати гру. Зробити ви це можете на всіх актуальних платформах.\n"
                    "PC\n"
                    "IOS\n"
                    "Android\n"
                    "Удачі і пам'ятайте:\n"
                    "Продовжуйте говорити, і ніхто не вибухне.",
            "photos": []
        },
        {
            "text": "Той самий легендарний Майнкрафт, де ти разом із новими друзями можеш побудувати і КМЦ, і гурто"
                    " на Трої, і метро Контрактова Площа. А також це єдина гра із сьогоднішнього переліку ігор,"
                    " для якої потрібно щось завантажувати на свій комп’ютер (так, саме ПК, тому що наш сервер"
                    " створений саме під комп’ютери). То як взагалі завантажувати цей Майнкрафт та заходити у"
                    " гру? Пояснюю.\n"
                    "1. Потрібно скачати будь-який лаунчер для Майнкрафту (наприклад TLauncher).\n"
                    "2. Після завантаження у лаунчері слід вказати ім’я користувача, під яким вас будуть"
                    " бачити інші гравці на сервері та обрати версію гри 1.16.3. (скрін 1)\n"
                    "3. Натиснути «запустити гру».\n"
                    "4. Після запуску гри обрати пункт «Multiplayer» (скрін 2).\n"
                    "5. Далі – натиснути Direct Connection (скрін 3), куди треба ввести IP-адресу серверу,"
                    " який можна знайти у текстовому каналі #майнкрафт на Discord-сервері ФрешФесту (скрін 4).\n"
                    "6. Натиснути «Join Server» та починати гру!\n\n"
                    "Зауважте, що на сервері одночасно може бути до 10 учасників. А також за бездіяльність"
                    " у грі більше 10 хвилин гравець автоматично відключається від серверу.\n"
                    "На цій чудовій ноті бажаємо вам гарної гри і щоб монстри не з’їли вас уже першої ночі!!",
            "photos": [types.InputFile('./static/m1.jpg'), types.InputFile('./static/m2.jpg'),
                       types.InputFile('./static/m3.jpg'), types.InputFile('./static/m4.jpg')]
        },
        {
            "text": "Мафія на ФФ в дискорді: як грати?\n"
                    "Що це таке?\n"
                    "Думаю, не слід навіть розказувати про таку відому гру, як “Мафія”. Кожен з нас хоч раз грав у"
                    " неї в колі друзів або навіть на професіональних турнірах. В умовах пандемії збиратися на мафію"
                    " стало доволі проблематично, але ми пропонуємо вихід: онлайн мафія в дискорді!\n"
                    "Технічні параметри \n"
                    "Мафія буде представлена як одна з ігор на нашому дискорд сервері (про те як користуватися"
                    " дискордом можна прочитати в окремій інструкції). На ньому є як голосові, так і текстові чати."
                    " У текстовий чат буде надходити інформація про набір гравців. Щоб зайти та взяти участь у грі,"
                    " обов’язково потрібно мати:\n"
                    "• Камеру \n"
                    "• Мікрофон \n"
                    "• Хороший настрій та бажання перемагати!\n"
                    "Проходити гра буде наступним чином:\n"
                    "1. В текстовий чат надходить інформація про те, чи є вільні місця (загальна кількість"
                    " гравців на одну гру – 11)\n"
                    "2. Люди заходять в голосовий чат та обов’язково одразу вмикають камеру та вимикають мікрофон\n"
                    "3. Після того, як набереться достатня кількість гравців, ведучий оголошує початок гри та пише"
                    " кожному в приватні повідомлення його роль у грі\n"
                    "4. Після того, як всі отримали роль, ведучий перевіряє готовність гравців та починає гру\n"
                    "Як грати?\n"
                    "Ділення на команди та ролі\n"
                    "Хоча Мафія дуже відома гра, все ж таки існують різні правила, різні ролі та інші особливості."
                    " Ось які ролі можна отримати у цій версії:\n"
                    "• Мирний мешканець (6 гравців)\n"
                    "• Мафія (2 гравця)\n"
                    "• Дон Мафії (1 гравець)\n"
                    "• Комісар (1 гравець)\n"
                    "• Лікар (1 гравець)\n"
                    "Загалом існують 2 команди: мафія та мирні мешканці. Завдання мафії та дона мафії вбити всіх "
                    "мирних мешканців (якщо кількість мафії та мирних мешканців однакова, мафія перемагає). Відповідно"
                    " завдання мирних мешканців, комісара та лікаря знайти мафію та вигнати її з міста. Перемога "
                    "зараховується, коли вся мафія вибуває.\n"
                    "Як проводиться гра\n"
                    "Гра починається з першого кола, коли всі гравці, починаються з гравця номер 1 (всі номери також"
                    " будуть розподілені), відкривають стіл. Після того, як поговорять всі гравці, місто засинає. "
                    "Прокидається мафія та вирішує, кого вона вб’є. Після цього місто прокидається та дається 1 "
                    "хвилина на “балаган” – всі гравці можуть говорити. Потім по черзі кожен гравець має 1 хвилину"
                    " на те щоб щось сказати стосовно ситуації на столі, його підозри і так далі. Можна виставляти"
                    " також людину на голосування, якщо буде більше ніж одна кандидатура то місто шляхом голосування "
                    "вирішує, хто має піти. Всі хто не проголосували автоматично голосують за останню кандидатуру. "
                    "Після цього місто засинає та все продовжується до перемоги однієї з команд.\n"
                    "Завдання мирних мешканців – знайти інших мирних гравців та скооперуватися з ними, визначити "
                    "хто мафія та вигнати її. Інші ролі більш активні та мають також опції дій вночі:\n"
                    "• Мафія вирішує, кого вона вб’є вночі (остаточне рішення приймає Дон Мафії)\n"
                    "• Дон Мафії приймає остаточне рішення щодо вбивства, а окрім цього він має можливість перевіряти"
                    " інших гравців на комісарство (Дон Мафії вказує номер гравця, після чого ведучий каже, "
                    "чи правильно він вгадав)\n"
                    "• Комісар шукає мафію, відповідно він також окремо прокидається вночі та називає номер гравця\n"
                    "• Лікар може лікувати гравців, тобто якщо він вгадає, кого захотіла вбити мафія вночі та вилікує"
                    " цю людину, то гравець не помре та продовжить грати. Лікар не може лікувати 2 людей підряд. "
                    "Також він може лікувати себе тільки 3 рази за гру.\n"
                    "Додаткові зауваження \n"
                    "• Вбитий гравець не може нічого казати, він просто вимикає камеру та мікрофон та (якщо хоче)"
                    " продовжує слідкувати за грою.\n"
                    "• Вночі ніхто не може спілкуватися, так само як і під час промови якогось гравця\n"
                    "• Більше детально про все розповість ведучий до початку гри та проінформує про всі"
                    " тонкощі та деталі\n"
                    "Чекаємо на тебе в дискорді на нашому сервері!",
            "photos": []
        }
    ]
